{
  "timestamp": 1732229458243,
  "data": {
    "reddit": [
      {
        "title": "My Software Sales Guy Beat Key Advisor's Ass in His Foyer in Front of His Wife Two Days Ago, How is Your Week Going?",
        "content": "I founded a software startup five years ago. We have raised about $3M and stretched that with sweat and no sleep to a solid enterprise-grade product. Four months ago, an outside advisor introduced me to someone he thought would be a great sales guy. So I hired him for a little test run. Was easy to tell he was going to be a problem. Insubordination, trying to order me around, general alpha douche attitude in general. And on top of all of that, he didn't get a single prospect teed up in three mon",
        "url": "https://reddit.com/r/startups/comments/1ga15gb/my_software_sales_guy_beat_key_advisors_ass_in/",
        "score": 768,
        "comments": 101,
        "source": "reddit",
        "subreddit": "startups"
      },
      {
        "title": "We’re profitable!!",
        "content": "Feels amazing! We’ve been working towards this for the last 24 months, after realising we probably weren’t going to get another round at a price higher than what we did at ath 2022.\n\n* 5 year old company\n* Single digit employees\n* 1,5M ish revenue, 10% profit margin (75% goes to salaries, so we scale very healthily from here)\n* Growing at around 400K profit per year\n* I still own around 70% together with my co-founder\n* And we’re all still friends\n\nJust wanted to brag 😎\n\nAma if you want!\n",
        "url": "https://reddit.com/r/startups/comments/1ggohh3/were_profitable/",
        "score": 655,
        "comments": 118,
        "source": "reddit",
        "subreddit": "startups"
      },
      {
        "title": "How I wasted 6 months building features nobody wanted - and what I learned about really listening to customers",
        "content": "It's painful to admit this, but I spent the first 6 months and nearly $40K of my own money building a startup in complete isolation. Like many technical founders, I fell into the classic trap of building features in isolation, thinking I knew what customers wanted. Here's what I learned the hard way.\n\n**The Expensive Assumption**\n\nMy assumption was simple: if customers were complaining about a problem, they'd want a solution.\n\nWrong.\n\nI built an entire suite of automation tools that absolutely n",
        "url": "https://reddit.com/r/startups/comments/1gb7n1y/how_i_wasted_6_months_building_features_nobody/",
        "score": 419,
        "comments": 93,
        "source": "reddit",
        "subreddit": "startups"
      },
      {
        "title": "Productivity hacks are overrated, says a16z VC who sold his own startup for $1.25B",
        "content": "I figured some of you all might need to hear this here. \nSource Techcrunch\n\n\nWhat’s the secret to startup success? Not the trends that so many Silicon Valley founders subscribe to, Andreessen Horowitz general partner VC Martin Casado said to a standing-room-only crowd at TechCrunch Disrupt last week. \n\nBefore joining the storied VC firm, Casado founded two other companies, including Nicira, a networking infrastructure company he sold to VMware for $1.25 billion. When asked for advice about achie",
        "url": "https://reddit.com/r/startups/comments/1gnz3iy/productivity_hacks_are_overrated_says_a16z_vc_who/",
        "score": 337,
        "comments": 42,
        "source": "reddit",
        "subreddit": "startups"
      },
      {
        "title": "I'll be your first customer ",
        "content": "Getting my first customer changed my life. After months of doubting myself someone actually paid for what I was selling. That moment changed everything for me. It wasn't about the money. That one person showed me my ideas was real. \n\nIf you're waiting for your first sale, keep going. If you see someone starting out, be their first customer. If you can't pay for someone's product give them feedback. You don't understand how much it could impact someone's life. \n\nIf you're just starting out I'd lo",
        "url": "https://reddit.com/r/startups/comments/1gpm522/ill_be_your_first_customer/",
        "score": 293,
        "comments": 210,
        "source": "reddit",
        "subreddit": "startups"
      },
      {
        "title": "I dove into startups 6 months ago, it was the best decision of my life",
        "content": "6 months ago I was just another lost high school senior with zero clue what to do next. It felt like there were two paths: either jumping on the entrepreneur path that was all over Instagram, or being the \"good kid\" heading to university.\n\nI thought... screw it, why pick? Started working on a startup while doing uni.\n\nFirst startup? Complete flop. But hey, failed fast and tried again. Second time was different - built an AI Web Design platform by myself and somehow managed to grow it to 8k users",
        "url": "https://reddit.com/r/startups/comments/1gtg25k/i_dove_into_startups_6_months_ago_it_was_the_best/",
        "score": 281,
        "comments": 56,
        "source": "reddit",
        "subreddit": "startups"
      },
      {
        "title": "How to validate ANY business idea before building it (and wasting time and money)",
        "content": "**Experienced Founder/ CEO here.**  \n  \nMy team and I have bootstrapped an education company from 5k to nearly $1M revenue in 2 years.  \nBut I've had some other business ideas that **failed BIG time**.   \n  \nThis is what this post is about and how to avoid that failure.  \n  \nSo, I did try SaaS, even Dropshipping, Amazon FBA, and more. **ALL failed.**\n\nAnd i hope this post helps you to not do the same mistakes that i did when i asked myself \"what online business can i start?\"\n\nI've failed not bec",
        "url": "https://reddit.com/r/startups/comments/1glf5wn/how_to_validate_any_business_idea_before_building/",
        "score": 278,
        "comments": 139,
        "source": "reddit",
        "subreddit": "startups"
      },
      {
        "title": "Hot take, AI sucks at coding",
        "content": "I am always seeing posts about how \"it's the best time to build\" because of AI wrappers like Bolt.new. What I don't understand is why people are promoting AI that can build basic CRUD apps like it was Steve Wozniak? AI will kill your startup before it's even started if you don't know how to code.\n\nMost senior engineers seem to agree with me, but the Twitter/X tech bros always lash out when I say this. I commented on a post talking about how AI writes shit code, and I was smoked, lol.",
        "url": "https://reddit.com/r/startups/comments/1ggjrmn/hot_take_ai_sucks_at_coding/",
        "score": 231,
        "comments": 270,
        "source": "reddit",
        "subreddit": "startups"
      },
      {
        "title": "Is it just me or is YC's Garry Tan a bit 'fake' ?",
        "content": "I sometimes listen to yc podcasts/lectures when doing chores. Loved listening to Paul Graham, Sam Altman and some other guest speakers. But one person I didn't like much is Garry Tan. He seems vague most of the time, and speaks in platitudes with very little insight. It's almost like he speaks words without intending to convey any meaning.\n\nHave any of you had the same experience while listening to him?",
        "url": "https://reddit.com/r/startups/comments/1ggyyld/is_it_just_me_or_is_ycs_garry_tan_a_bit_fake/",
        "score": 211,
        "comments": 61,
        "source": "reddit",
        "subreddit": "startups"
      },
      {
        "title": "YC cofounder match sucks",
        "content": "I’m technical cofounder looking for other potential cofounders and YC profiles are mostly a spam. Most of the profiles don’t include a proper description of their ideas. And some cofounders trying to offer less than 30% of equity for technical cofounders. Same story with the ones who send connect requests. Someone sent a request message offering me 0.5% equity with no pay. lol I don’t even know what to say. It’s like after skipping 100 profiles you’ll find a one good profile. \n\nWorst part is the",
        "url": "https://reddit.com/r/startups/comments/1gp3tea/yc_cofounder_match_sucks/",
        "score": 200,
        "comments": 193,
        "source": "reddit",
        "subreddit": "startups"
      },
      {
        "title": "Play Hard, Failed Hard - Building a company from 0 to over 1,000 employees in 5 years, raising more than $130M - Lessons from scaling (very) fast.",
        "content": "I've told my story in another post, in short: In 2017, I co-founded an e-commerce startup, dedicating relentless hours to propel it through YCombinator and multiple funding rounds, ultimately scaling the company to 1,000+ employees and raising over $130 M. As COO, I managed a vast team amidst rapid growth and intense pressure, leading to the heartbreaking decision to lay off 900 employees in 2022.\n\nIn this post, I want to discuss a subject that has been requested by people in the comments—if the",
        "url": "https://reddit.com/r/startups/comments/1geuv4a/play_hard_failed_hard_building_a_company_from_0/",
        "score": 192,
        "comments": 71,
        "source": "reddit",
        "subreddit": "startups"
      },
      {
        "title": "I just had the best idea for a startup! Wait… no… 10 ideas!",
        "content": "- LLM wrappers on existing saas tools\n- integrate everything all-in-one AI agent\n- founder/mentorship/indiehacker tools\n- piece of marketing (positioned as SaaS)\n- coding tools for your coding tools\n- AI automation to job hunt faster\n- Sales faster, with … AI\n- track all your things in one app, with Ai\n- build a site in seconds… AI + webflow \n- AI driven templates for your AI workflow\n\nSeriously that’s all this sub is bye 👋 ",
        "url": "https://reddit.com/r/startups/comments/1gq3vod/i_just_had_the_best_idea_for_a_startup_wait_no_10/",
        "score": 186,
        "comments": 61,
        "source": "reddit",
        "subreddit": "startups"
      },
      {
        "title": "Why don't VCs just allow founders to pay themselves &gt;= $300k so startups are more competitive with MAANG?",
        "content": "For as long as I can remember VCs have argued that they want to pay founders a lower salary for two main reasons:\n\n- They want the founders focused on long term value of the startup, not the salary.\n\n- They want more of the investment to go into growing the company.\n\nHowever, I think the issue now is that MAANG is paying &gt;= $500k total comp and since your RSUs are liquid you can exercise often.\n\nThis locks up a LOT of talent in MAANG companies.\n\nAdditionally, it doesn't align the investors to",
        "url": "https://reddit.com/r/startups/comments/1gsgavi/why_dont_vcs_just_allow_founders_to_pay/",
        "score": 186,
        "comments": 132,
        "source": "reddit",
        "subreddit": "startups"
      },
      {
        "title": "99% of my SaaS are managed in Google Sheets",
        "content": "Started doing that about a year ago, especially in early stages when building the MVP, and never looked back.  \n(Actually, one of my products got acquired with this structure.)\n\nHere's how it goes:\n\n1. User fill out a form\n2. Form trigger an automation (add new row to spreadsheet + send email to user)\n3. User receives access details to the SaaS\n4. Product access spreadsheet data to validate user authenticity\n\nDon't overthink it!\n\nOnce the product get traction, I switch things up for something mo",
        "url": "https://reddit.com/r/startups/comments/1gjgi8r/99_of_my_saas_are_managed_in_google_sheets/",
        "score": 164,
        "comments": 126,
        "source": "reddit",
        "subreddit": "startups"
      },
      {
        "title": "Startup early hire v.s. FAANG",
        "content": "I’m in a position where a startup is offering me to join as an early engineer, with the following compensation breakdown:\n\n$180k base\n1% equity\n\nThey raised a seed round of $3.5m. \n\nMy current position is L4 at a FAANG with ~$150k base, ~$200k in unvested RSUs, with L5 promo timeline around Q2 of 2025. \n\nThe startup is very fresh, however I’m impressed with the founders, the product is interesting, and the day-to-day work will be much more impactful than the monotonous infrastructure bs I work o",
        "url": "https://reddit.com/r/startups/comments/1gdcu2x/startup_early_hire_vs_faang/",
        "score": 138,
        "comments": 117,
        "source": "reddit",
        "subreddit": "startups"
      },
      {
        "title": "Don’t start a SaaS if you want to make money",
        "content": "If you’ve ever considered SaaS as an opportunity to make some passive income then I guess this is for you.\n\nFirstly, I own a SaaS company that does $1m ARR. Which sounds good on paper. Until I tell you the backstory of what it took to get there, the toil of raising investment and the sheer hours that you have to spend building a team.\n\nSo I’ll start with the myths.\n\nSaaS is NOT a passive income stream unless you are NOT the owner.\n\nStarting a software business starts with a spotting a problem an",
        "url": "https://reddit.com/r/SaaS/comments/1gvbmin/dont_start_a_saas_if_you_want_to_make_money/",
        "score": 485,
        "comments": 179,
        "source": "reddit",
        "subreddit": "SaaS"
      },
      {
        "title": "This is how I launch every product",
        "content": "Hey Guys,\n\nFirst post here. I saw a post on twitter where someone shared the following checklist on how they go about launching their product. Since distribution is the key, I would like to hear from you on how you go about launching your product any checklist that you follow?\n\n* Email waitlist subscribers\n* Post on X (Twitter)\n* Post on LinkedIn\n* Post on Facebook groups\n* Email 10x mailing list (7k subscribers)\n* Email contacts (seed list)\n* Submit to Product Hunt\n* Submit to Betalist\n* Submit",
        "url": "https://reddit.com/r/SaaS/comments/1gojlbz/this_is_how_i_launch_every_product/",
        "score": 344,
        "comments": 52,
        "source": "reddit",
        "subreddit": "SaaS"
      },
      {
        "title": "I'll be the first to pay for your product",
        "content": "Getting my first customer changed my life. After months of doubting myself someone actually paid for what I was selling. That moment changed everything for me. It wasn't about the money. That one person showed me my ideas was real.\n\nIf you're waiting for your first sale, keep going. If you see someone starting out, be their first customer. If you can't pay for someone's product give them feedback. You don't understand how much it could impact someone's life.\n\nIf you're just starting out I'd love",
        "url": "https://reddit.com/r/SaaS/comments/1gpmfdv/ill_be_the_first_to_pay_for_your_product/",
        "score": 326,
        "comments": 267,
        "source": "reddit",
        "subreddit": "SaaS"
      },
      {
        "title": "Making $4000-$5000/month with just a free DNS lookup Tool",
        "content": "Saw this post of a guy who built two Saas free web tools.\n\nA DNS Lookup tool and ISP checker tool\n\n100% Free\n\nMonetization by Ads and he's currently making about $4000/month with these two tools.\n\nHe built something that people actually wanted and not just some \"fast shipping\" dumb.\n\nHas 800,000+  website visitors combined on both tools.",
        "url": "https://reddit.com/r/SaaS/comments/1glceff/making_40005000month_with_just_a_free_dns_lookup/",
        "score": 298,
        "comments": 119,
        "source": "reddit",
        "subreddit": "SaaS"
      },
      {
        "title": "Just hit 5000K MRR",
        "content": "Ok been reading these ridiculous posts for past few weeks where people boast about hitting 5k in 2 days or 10k in MRR without any proof. So here is mine:\n\n- got a developer to develop me a procurement software. He took good 12mths to build it\n- spent good £6000\n- initial version was shit\n- rebuilt it (still not happy with it tbh)\n- launched it\n- spent on marketing. Tried webinars, paid traffic, cold email campaigns. You name it, I have done it.\n- spend thousands on saas marketing courses and tri",
        "url": "https://reddit.com/r/SaaS/comments/1ggoto3/just_hit_5000k_mrr/",
        "score": 294,
        "comments": 123,
        "source": "reddit",
        "subreddit": "SaaS"
      },
      {
        "title": "I can't handle this anymore - I'm selling my product and finding a job",
        "content": "Hey everyone,\n\n​I'm not looking for a \"push harder\" or \"never quit\" comment. I busted my ass off the past 18 months. In the mean time everyone screwed me over. My co-founder, my supposed client, everyone. I was about to score a 30k ARR deal with a big company, then my co-founder screwed me, then for reasons out of my control(the leadership there changed) my supposed client backed out after a 9 month pilot. I'm exhausted and never have time or money for myself. I need to take a step back and focu",
        "url": "https://reddit.com/r/SaaS/comments/1gei4e9/i_cant_handle_this_anymore_im_selling_my_product/",
        "score": 290,
        "comments": 239,
        "source": "reddit",
        "subreddit": "SaaS"
      },
      {
        "title": "JUST HIT 10K MRR!!!! 🚀🚀🚀",
        "content": "Every other post is some broccoli-headed 'entrepreneur' who just discovered what an API is, slapped ChatGPT in a wrapper, and thinks they're the next fucking Zuckerberg.  \nThe worst part? Tomorrow there'll be 5 more copycats doing the exact same shit with the exact same landing page template.\n\n  \nPlease stop",
        "url": "https://reddit.com/r/SaaS/comments/1ggewwp/just_hit_10k_mrr/",
        "score": 250,
        "comments": 94,
        "source": "reddit",
        "subreddit": "SaaS"
      },
      {
        "title": "Marketing your Saas",
        "content": "There are good engineers and founders with super great products but stuck at marketing.\n\nHere is a quick, short list of things you can do to kick off your marketing.\n\nPS: I have scaled 5+ startups to 50k+ MRR and am currently working on an adtech product.\n\n\n\nBefore we start, here are some heads-ups.\n\na. All I am about to tell is my experience and what worked for me.\n\nb. B2C is easy to scale compared to B2B. \n\nc. Don’t try to make anything viral - It's not in your control.\n\nd. Be willing to spend",
        "url": "https://reddit.com/r/SaaS/comments/1ggnks8/marketing_your_saas/",
        "score": 251,
        "comments": 46,
        "source": "reddit",
        "subreddit": "SaaS"
      },
      {
        "title": "“I made $100k with a hello world app” or the downfall of indiehackers",
        "content": "Yes, we finally reached the point where indiehacking changed, but in a bad sense…\n\nIt became a get-rich-quick scheme and flooded with products selling you a dream (not SaaS by the way)\n\nIf you’ve observed carefully, you could have spotted a pattern between the internet trends of broccoli soy boys selling courses or dumb digital products, in different niches\n\nWell, finally it reached SaaS and indiehacking\n\nNow, you can see people claiming to be “successful SaaS founders”, while selling a boilerpl",
        "url": "https://reddit.com/r/SaaS/comments/1g9jbuh/i_made_100k_with_a_hello_world_app_or_the/",
        "score": 228,
        "comments": 116,
        "source": "reddit",
        "subreddit": "SaaS"
      },
      {
        "title": "Here I am, 6 months after claiming to have built a SaaS product in 2 weeks",
        "content": "The title says it all. \n\nAs someone who has now built something of value for the first time, I can confidently say all these posts claiming to have built anything in xx days that isn't another Chat with PDF are total bullsh*t. \n\nBuilding is hard, building great stuff is harder. Building something people would want to pay for is insanely difficult… but it gets easier eventually. \n\nJust keep up the great work and share what you’ve achieved so far! ",
        "url": "https://reddit.com/r/SaaS/comments/1gbqd2d/here_i_am_6_months_after_claiming_to_have_built_a/",
        "score": 227,
        "comments": 109,
        "source": "reddit",
        "subreddit": "SaaS"
      },
      {
        "title": "(PART 2) (RESULTS) \"My software agency is failing – I'm exhausted from not landing a single new client for months. I have an amazing team, and I don’t want to let anyone go…\"",
        "content": "So, I posted here a while back about[ how my software agency hasn’t landed a single new client in months. I’ve got an amazing team, and I don’t want to let anyone go—but things have been tough](https://www.reddit.com/r/SaaS/comments/1g4vwi0/my_software_agency_is_failing_im_exhausted_from/). After getting an incredible response, I wanted to share **the results** with you all. The post got over **150,000 views, 150+ comments**, and I received **50 DMs** from people reaching out for all kinds of re",
        "url": "https://reddit.com/r/SaaS/comments/1gflzbc/part_2_results_my_software_agency_is_failing_im/",
        "score": 225,
        "comments": 56,
        "source": "reddit",
        "subreddit": "SaaS"
      },
      {
        "title": "My first $10k from bubble!!!",
        "content": "Here's what happened:\n\n6 months ago, I was reallyyy short on money and needed to find a solution to pay rent. \n\nI thought why not put my bubble skills to the service of others and see the outcome. \n\nPosted on Reddit the app that I built: [https://airmedia.uk](https://airmedia.uk) and offered MVPs starting from $3k and got a lot of interest for it. \n\nIn 3 weeks I finished and delivered two projects. Since then, I've gotten recommendations into other people. Now I know firsthand why people say wor",
        "url": "https://reddit.com/r/SaaS/comments/1gdybtb/my_first_10k_from_bubble/",
        "score": 223,
        "comments": 128,
        "source": "reddit",
        "subreddit": "SaaS"
      },
      {
        "title": "Can we ban self-promotion entirely?",
        "content": "This sub is getting flooded with self-promo posts disguised as \"helpful\" content. It used to be manageable, but now it feels like every other post is just more of the same. Can we just ban self-promotion altogether and bring back the useful real discussions?",
        "url": "https://reddit.com/r/SaaS/comments/1gt3fni/can_we_ban_selfpromotion_entirely/",
        "score": 218,
        "comments": 90,
        "source": "reddit",
        "subreddit": "SaaS"
      },
      {
        "title": "boring site... now at $2540 mrr with 43k monthly traffic (just with SEO)",
        "content": "A boring directory...\n\nYet I love them.\n\nit is an SEO game... and it is changing fast\n\nI did a post here about a month ago.\n\nA LOT has changed...\n\nSince then:\n\n→ mrr grew from $1.1k to $2.5k... more than double... crazy\n\n→ our SEO is a hockey stick. [Here is proof](https://i.postimg.cc/T1Jt2DB9/Screenshot-2024-09-19-at-14-53-46.png) and here is [more proof](https://i.postimg.cc/5y4w3kkB/Screenshot-2024-09-19-at-15-36-49.png) \\- now it dropped to about 30k - 40k/mo\n\n→ someone on Reddit offered $1",
        "url": "https://reddit.com/r/SaaS/comments/1gb297c/boring_site_now_at_2540_mrr_with_43k_monthly/",
        "score": 210,
        "comments": 88,
        "source": "reddit",
        "subreddit": "SaaS"
      },
      {
        "title": "Creating a $100 MRR SaaS is harder than getting a $150k/yr job",
        "content": "Maybe I'm just not business savvy enough.\n\nI find that creating a SaaS with a small revenue like just $100 MRR is way harder than getting a regular dev job. If you are in the US, say on average the salary is $150k/yr. If you are in a lower income country, maybe the average salary is only $10k/year, the story still holds the same.\n\nI wonder why is it in this profession, that makes a solo SaaS business is harder than becoming a dev.\n\nWith other profession, say you are a chef. Getting from a chef t",
        "url": "https://reddit.com/r/SaaS/comments/1gg5r76/creating_a_100_mrr_saas_is_harder_than_getting_a/",
        "score": 197,
        "comments": 125,
        "source": "reddit",
        "subreddit": "SaaS"
      },
      {
        "title": "My company crossed $120K in revenue after working like crazy for 1 year and 3 months.",
        "content": "My Software development company crossed $120K in revenue after working like crazy for 1 year and 3 months.\n\nTLDR; I left my job in July 2023 in Singapore and Started my company UniqueSide in Singapore. It's been more than a year and it crossed $120K in revenue.\n\nFull:\nI have been working in the software industry for more than 7 years now. Have worked with big company, mid AI startup as well as early age startup. I started building products in 2015. \n\nI launched multiple products when I was doing",
        "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1gk6xs8/my_company_crossed_120k_in_revenue_after_working/",
        "score": 87,
        "comments": 21,
        "source": "reddit",
        "subreddit": "EntrepreneurRideAlong"
      },
      {
        "title": "What I learned from spending $50k on ads",
        "content": "For the last 8 months I've been running a newsletter for freelance software developers, and my main way of attracting subs was through paid media. In those last 8 months I've spent \\~$50k on hundreds of ad campaigns on twitter and meta\n\nAt the start I was a complete beginner, didn't know a thing about paid ads. But it seemed easy enough. Pay for exposure, get subs, make money. Yaa I was naive. Over the last 8 months here's what I learned while learning the ropes\n\n**1. Ad creative quality matters",
        "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1ggmmv4/what_i_learned_from_spending_50k_on_ads/",
        "score": 84,
        "comments": 32,
        "source": "reddit",
        "subreddit": "EntrepreneurRideAlong"
      },
      {
        "title": "From Zero to $20K in 4 Months: What Should I Do Next?",
        "content": "Hi all, I'm the founder of [Infography ](https://infography.in)\\- a simple tool that converts blogs into beautiful infographics. I initially launched this product in March 2024, but I didn't generate any profitable revenue. Therefore, in July, I changed the pricing model from a subscription to a one-time payment to determine if it was truly worth building. Around that time, a few affiliate marketers also joined my affiliate program and started promoting the tool and then the sales started to exp",
        "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1geq1vp/from_zero_to_20k_in_4_months_what_should_i_do_next/",
        "score": 84,
        "comments": 52,
        "source": "reddit",
        "subreddit": "EntrepreneurRideAlong"
      },
      {
        "title": "How to Make Customers Stay?",
        "content": "Retention isn’t just about keeping customers happy—it’s about keeping them engaged. I’ve seen businesses struggle with this, and I’ve used a few strategies that work, without relying on things like discounts or giveaways.\n\nOne approach that’s worked well is creating a referral circle. Instead of just offering rewards for referrals, connect loyal customers with each other in a way that benefits them too. For example, if you’re working with small business clients, you could create a platform or a ",
        "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1guiwv1/how_to_make_customers_stay/",
        "score": 77,
        "comments": 12,
        "source": "reddit",
        "subreddit": "EntrepreneurRideAlong"
      },
      {
        "title": "We went from 0 users to 1600+ users after 80 days of effort and $0 spent.",
        "content": "I'll tell you exactly how we did it, but first you should know:\n\n**the bar is a lot lower than you think.**\n\n* Most people aren't following a clear process for building and launching their products.\n* Most people quit trying after 2-5 months.\n* Most people don't have a plan.\n\nYou don't need to work 70 hour weeks and be an expert to succeed. You just need to not make the common mistakes and stick around for a bit longer. That's enough.\n\n**Now, here's exactly how we went from 0 users and 0 traffic",
        "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1gsqqds/we_went_from_0_users_to_1600_users_after_80_days/",
        "score": 64,
        "comments": 14,
        "source": "reddit",
        "subreddit": "EntrepreneurRideAlong"
      },
      {
        "title": "I launched a SaaS 12 days ago and it's made $4.9k so far, what next?",
        "content": "So I recently launched an all-in-one platform that bundles 1500+ AI tools into one subscription for $15/mo (no API keys needed).\n\nAI tools of daily life such as Youtube video summarizer, AI image generator, AI headshot generator, AI illustration generator, AI music generator, AI voice cloning, chat with PDFs and many more. Whatever I used to pay for, I've added in this.\n\nIt also provides access to all popular LLMs and AI models you can think of like ChatGPT, Claude, Flux, Stable Diffusion, Midjo",
        "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1gh9dx9/i_launched_a_saas_12_days_ago_and_its_made_49k_so/",
        "score": 57,
        "comments": 54,
        "source": "reddit",
        "subreddit": "EntrepreneurRideAlong"
      },
      {
        "title": "Biggest lesson I’ve learned so far: Build relationships, not just businesse",
        "content": "One thing that’s become clear to me over the years is that real success in business goes beyond revenue and growth; it’s about the people you connect with along the way. Early on, I was focused on numbers and products, but the most valuable “asset” turned out to be the network I built by helping others, sharing insights, and listening.\n\nSo, here’s my take if you’re just starting out, invest time in building real relationships, not just client lists or profit margins. Engage with people who share",
        "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1gcikqc/biggest_lesson_ive_learned_so_far_build/",
        "score": 53,
        "comments": 13,
        "source": "reddit",
        "subreddit": "EntrepreneurRideAlong"
      },
      {
        "title": "9 things I learned building an app with no technical background",
        "content": "This is a write up I posted over in r / entrepreneur that I thought might be applicable here.\n\nOver the past two years, my boss (my wife) finally gave me permission to chase my crazy ideas and build a couple apps for business ideas I had. While I’ve played around with WordPress some before, I have no real technical background when it comes to coding, developing, etc.\n\nThe harsh reality is this. **I wasted A LOT of time and A LOT of money because of things I had to learn the hard way.** I’m hopin",
        "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1ggbwky/9_things_i_learned_building_an_app_with_no/",
        "score": 51,
        "comments": 10,
        "source": "reddit",
        "subreddit": "EntrepreneurRideAlong"
      },
      {
        "title": "I got laid off from my corporate job in June, and my side hustle suddenly became my main hustle. After spending 4 months building my first iOS app, I've just passed 300 downloads and 30 paying subscribers. Here are 5 key takeaways from my experience so far.",
        "content": "Long story short, in June I very suddenly was laid off from my cushy corporate job in London. Though shocking at the time, I quickly realised this presented an opportunity to sink all of my newfound free time into building out an idea for a news app that I'd had knocking around in my head for about a year:\n\nI've long been looking for a more efficient way to consume news on specific topics related to my career and interests. In an ideal world, I wanted all important news in the last t24 hours for",
        "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1geyz1e/i_got_laid_off_from_my_corporate_job_in_june_and/",
        "score": 47,
        "comments": 12,
        "source": "reddit",
        "subreddit": "EntrepreneurRideAlong"
      },
      {
        "title": "Why It Took Me Over 10 Years to Earn My First Dollar Building Apps",
        "content": "When I first set out to build my own apps over a decade ago, I imagined a quick path to success: create a great product, launch it, and start generating revenue. Fast forward ten years, and that first dollar finally hit my account. The journey taught me much about patience, persistence, and the realities of building a product from scratch. Here’s a reflection on why it took so long and what I learned along the way.\n\n# 1. Underestimating the Learning Curve\n\nBuilding apps sounds straightforward in",
        "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1gnplc3/why_it_took_me_over_10_years_to_earn_my_first/",
        "score": 38,
        "comments": 8,
        "source": "reddit",
        "subreddit": "EntrepreneurRideAlong"
      },
      {
        "title": "I created \"Duolingo for Communication\" after watching 1000+ people struggle with public speaking",
        "content": "Hey fellow entrepreneurs!\n\nI want to share something that changed my perspective on communication forever, and maybe it'll change yours too.\n\n**The lightbulb moment came from watching people struggle.**\n\nFor the past 1-1.5 year, I've been obsessed with public speaking and communication. I've watched around 1000 presentations, from startup pitches to TED talks, trying to understand what makes some people captivating while others... well, not so much.\n\nHere's what blew my mind: The difference betw",
        "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1gah9yv/i_created_duolingo_for_communication_after/",
        "score": 38,
        "comments": 27,
        "source": "reddit",
        "subreddit": "EntrepreneurRideAlong"
      },
      {
        "title": "Month 2 of building my startup after being laid off - $200 in revenue and 4 (actual) paying customers",
        "content": "In September 2024, I got laid off from my Silicon Valley job. It fucking sucked. I took a day to be sad, then got to work - I'm not one to wallow, I prefer action. Updated my resume, hit up my network, started interviewing.\n\nDuring this time, I had a realization - I'm tired of depending on a single income stream. I needed to diversify. Then it hit me: I literally work with RAG (retrieval augmented generation) in AI. Why not use this knowledge to help small businesses reduce their customer servic",
        "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1gmntpu/month_2_of_building_my_startup_after_being_laid/",
        "score": 35,
        "comments": 8,
        "source": "reddit",
        "subreddit": "EntrepreneurRideAlong"
      },
      {
        "title": "People are overthinking with digital products.",
        "content": "All you really need is a checkout link to start. \n\nI failed a lot of times. Literally I could build the whole landing page, admin panel, ai automation to handle moderation and content. After spending months in vacuum building more, more, more features. Launching and getting 0 customers in the end. \n\nYou are literally just getting depressed. \n\nYou know that feeling, right ? Me too. \n\nWe missed one important step before building anything - ASKING. We need to ask more clients, users, and do our res",
        "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1gnyj1n/people_are_overthinking_with_digital_products/",
        "score": 33,
        "comments": 24,
        "source": "reddit",
        "subreddit": "EntrepreneurRideAlong"
      },
      {
        "title": "After 5 years I finally made enough money to file taxes ",
        "content": "\nHowdy everyone,\n\nFor the first time in 5 years I will actually file a profit for my LLC. \n\nIn the last 5 years I’ve tried and failed to build various different SaaS platforms. For the most part, I wasn’t validating ideas early, I was obsessed with engineering instead of marketing, and I focused on building “cool features” instead of solving real problems.  \n\nIn my latest venture, I took a step back, I built a small and simple chrome extension called ChatGPT Queue, and made sure it worked seamle",
        "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1gjsa4d/after_5_years_i_finally_made_enough_money_to_file/",
        "score": 31,
        "comments": 12,
        "source": "reddit",
        "subreddit": "EntrepreneurRideAlong"
      },
      {
        "title": "Autistic/Adhd Entrepreneurs, what would you recommend for someone with major Executive Dysfunction?",
        "content": "Sick of barely surviving despite being 'intelligent' I can only ever make money when it's do or die, fight or flight time. I've nearly 2 decades experience in the graphics side of Internet marketing and know a fair bit about that circle. \n\nI just want to be able to take my family on holiday, not wait another 10yrs. At my wits end. ",
        "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1gsms5n/autisticadhd_entrepreneurs_what_would_you/",
        "score": 32,
        "comments": 32,
        "source": "reddit",
        "subreddit": "EntrepreneurRideAlong"
      },
      {
        "title": "Lost my biggest client because I missed their Reddit complaint - a $50k lesson in humility",
        "content": "I've been running a small software development agency for the past 3 years. We had a steady stable of clients, but one in particular made up about 40% of our revenue - about $50k annually. Everything seemed to be going great until last month.\n\nTurns out, their CTO had posted about some performance issues on Reddit three weeks ago. Not even a complaint really, just asking if anyone else was experiencing similar issues with their integration. A competitor saw it within hours and jumped into their ",
        "url": "https://reddit.com/r/smallbusiness/comments/1glwmq3/lost_my_biggest_client_because_i_missed_their/",
        "score": 2056,
        "comments": 306,
        "source": "reddit",
        "subreddit": "smallbusiness"
      },
      {
        "title": "I (24m) make 600k but hate my business.",
        "content": "Title summarises it pretty well. I started this business in my last year of high school. It worked out fairly well and currently turns over about 1.8-2.8m per year. \n\nWhen I first began it was all so exciting. Building the brand, creating a vision, and setting goals. I couldn’t be more fulfilled as we accomplished each one for the next 3-4 years. It was never about the money, I lived very frugally (70k pa) until a year or so ago.\n\nThen the growth settled - as expected for the work we do in Austr",
        "url": "https://reddit.com/r/smallbusiness/comments/1gd3n00/i_24m_make_600k_but_hate_my_business/",
        "score": 427,
        "comments": 266,
        "source": "reddit",
        "subreddit": "smallbusiness"
      },
      {
        "title": "Friends parents won’t pay me for the work I did",
        "content": "One of my closest friend’s parents asked me to help get their basement renovated as I’m an architectural designer and work with contractors for my business. It was over their budget so they saved up for a year and then asked me if I could do the permit drawings for them. They wanted to get it done asap so I verbally quoted them $3000 +hst and 4 weeks to do the site measure, schematic phase check-in, and final drawing to be stamped. Then I would set up their application and apply for them and mak",
        "url": "https://reddit.com/r/smallbusiness/comments/1gu1qfr/friends_parents_wont_pay_me_for_the_work_i_did/",
        "score": 423,
        "comments": 279,
        "source": "reddit",
        "subreddit": "smallbusiness"
      },
      {
        "title": "Co-owner using company card for personal purchases ($20000+)",
        "content": "I own a business with three other people (25% ownership each). I've discovered one of the owners (let's call them Karl) has been using their company credit card for personal purchases going back at least two years totalling over $20,000. When I asked Karl about one of the purchases for $2300 he told me he he needed to use his company card because his personal card did not work - that charge was over a year ago and he keeps saying he will pay it back next week. It has been six months since confro",
        "url": "https://reddit.com/r/smallbusiness/comments/1govem8/coowner_using_company_card_for_personal_purchases/",
        "score": 337,
        "comments": 229,
        "source": "reddit",
        "subreddit": "smallbusiness"
      },
      {
        "title": "Trump tariffs, Fox News, and how / why this is being sold to the American public ",
        "content": "Hello folks - my first post in this sub, and its a doozy - a real novel! But I needed to get this off my chest, and y’all are the victims!! Let me state clearly right off the bat, that regardless of what I, or any of you feel about Trump's election in regards to all of the social, political, and non-business issues, I would like to be clear that I'm only talking about Trump's economic plans, here, and more specifically, how such drastic proposals came to gain traction with the public, and why - ",
        "url": "https://reddit.com/r/smallbusiness/comments/1go9kbw/trump_tariffs_fox_news_and_how_why_this_is_being/",
        "score": 306,
        "comments": 454,
        "source": "reddit",
        "subreddit": "smallbusiness"
      },
      {
        "title": "Breaking 100k gross today",
        "content": "Que the \"I never thought Id make it this far\" Ik 100k isn't even that much in the grand scheme of things.\n\nTo me its a pretty good milestone. 100 thousand dollars. I mean that's a pretty good chunk right. Last year I did 75k\n\nIdk, its the end of the year and I hit my goal. Life is ok.",
        "url": "https://reddit.com/r/smallbusiness/comments/1gh82pi/breaking_100k_gross_today/",
        "score": 288,
        "comments": 71,
        "source": "reddit",
        "subreddit": "smallbusiness"
      },
      {
        "title": "My University just gave me $10,000 for my business",
        "content": "So, I never thought I'd be saying this, but my university just gave me $10,000 to keep working on my business. Yeah, seriously.\n\nA bit of background—I’m a civil engineering student, and I started a little business selling dog collars. I even managed to make it count as one of my required co-op terms, which I thought was pretty wild. The business is doing okay, and I figured, why not see if I can get some funding? So, I applied for a few grants through the engineering department and the universit",
        "url": "https://reddit.com/r/smallbusiness/comments/1gcvjdf/my_university_just_gave_me_10000_for_my_business/",
        "score": 278,
        "comments": 57,
        "source": "reddit",
        "subreddit": "smallbusiness"
      },
      {
        "title": "I am a 22 y.o. college dropout in hopes of starting a business and I think I did a huge mistake.",
        "content": "I dropped out of college this year because no college  was teaching what I actually  wanted to learn. Ever since I was a kid I wanted to an entrepreneur. \n\nBut everyone in my college was like get a good job and you will be settled for life but no one understands I don't want to do a job for the rest of my life (no offense to anyone). I come from CSE background and I have a diploma in it. But I haven't really worked anywhere in my life. I don't have any work experience and not to lie I don't even",
        "url": "https://reddit.com/r/smallbusiness/comments/1gjbvd3/i_am_a_22_yo_college_dropout_in_hopes_of_starting/",
        "score": 270,
        "comments": 295,
        "source": "reddit",
        "subreddit": "smallbusiness"
      },
      {
        "title": "People love to stop by but never buy anything ",
        "content": "Posting on behalf of a friend that doesn’t have reddit but wants advice:\n\nPeople love coming to her store to check out her stuff. She’s like a creepy oddities thrift store. People love to come spend time with her but it rarely turns into a sale. When she posted she’d be closing hundreds of people were heartbroken because she’s a pillar of the community but where is that energy when it comes to buying *something*\n\nHow can she profit off of her friendliness? She’s tried classes, movie nights, soci",
        "url": "https://reddit.com/r/smallbusiness/comments/1gd42jt/people_love_to_stop_by_but_never_buy_anything/",
        "score": 263,
        "comments": 184,
        "source": "reddit",
        "subreddit": "smallbusiness"
      },
      {
        "title": "Dammit.  It Was Our Time to Shine.  ",
        "content": "I just want to have a space to share my overwhelming disappointment in this moment in my life.  Only business owners can truly understand so… here goes.  \n\nAfter 15 years hustling and growing while staying true to our core principles and business plan, we (my spouse is the we) have reached a level of success far past our expectations when we started.  We have grown exponentially since the pandemic due to the incredible growth throughout the region.  We are a recognized brand in our field locally",
        "url": "https://reddit.com/r/smallbusiness/comments/1geqo7p/dammit_it_was_our_time_to_shine/",
        "score": 252,
        "comments": 48,
        "source": "reddit",
        "subreddit": "smallbusiness"
      },
      {
        "title": "I am very worried about tariffs",
        "content": "I own a retail store.  Honestly we have had the best 4 years.   We keep braking records every month.  It isn’t easy and i have to work at it but we are making money.  \n\nWhen Trump put the Chinese tariffs on us my invoices jumped on average 8% overnight.  Of course i had to pass that on to my customers.  There wad some grumbling but not too bad.  Then all the covid demand hit and invoices jumped again on average it was 15% this time.  I had to pass that on.  There was more grumbling. \n\nOver the p",
        "url": "https://reddit.com/r/smallbusiness/comments/1gmy1cn/i_am_very_worried_about_tariffs/",
        "score": 239,
        "comments": 541,
        "source": "reddit",
        "subreddit": "smallbusiness"
      },
      {
        "title": "Gen Z Employees",
        "content": "EDIT 2: Please be aware that we a located in Stuttgart, Germany. A lot of comments make a lot of sense for the US market but not the (media) market in Germany 🇩🇪\n\n\nHi everyone, I need some perspective here. Am I in the wrong?\n\nEvery time I try to hire a new employee under the age of 25, I struggle to get them to commit to signing a contract. I don’t face this issue with older generations, but with Gen Z, it seems like they have a completely different mindset when it comes to work. We’re a digi",
        "url": "https://reddit.com/r/smallbusiness/comments/1g9iafu/gen_z_employees/",
        "score": 233,
        "comments": 155,
        "source": "reddit",
        "subreddit": "smallbusiness"
      },
      {
        "title": "How I Turned a Rude Client into a Loyal Customer",
        "content": "Hey, everyone! I wanted to share a recent experience at my bakery that really opened my eyes to how to handle difficult clients, and I’d love to hear your thoughts.\r\n\r\nA few weeks ago, a woman came in during the lunch rush, looking frustrated right from the start. She immediately started criticizing our menu, asking why we didn’t have her favorite pastry available. Honestly, I could feel my blood boiling a bit; I had just spent hours prepping, and it was disheartening to hear her complaints.\r\n\r\n",
        "url": "https://reddit.com/r/smallbusiness/comments/1gfflbd/how_i_turned_a_rude_client_into_a_loyal_customer/",
        "score": 224,
        "comments": 45,
        "source": "reddit",
        "subreddit": "smallbusiness"
      },
      {
        "title": "Anyone say \"F*ck it\" and just walk away?",
        "content": "I have grown to hate my business. The past year, I've worked incredibly hard to open another location. Sales have been disappointing and have left me chained to the business until sales improve enough to hire more help. There's a lot of competition in the area, so I'm skeptical that day will ever come.\n\nI don't have time freedom. I don't have location freedom. I'm taking a VERY small personal salary. I don't like where I live. I'm hundreds of miles away from friends and family.\n\nI can't just win",
        "url": "https://reddit.com/r/smallbusiness/comments/1ggh6j6/anyone_say_fck_it_and_just_walk_away/",
        "score": 219,
        "comments": 214,
        "source": "reddit",
        "subreddit": "smallbusiness"
      },
      {
        "title": "Unhinged client leaves bad google reviews under fake names every few hours. ",
        "content": "I have been in business for 15 years. We are a very small business. There is only 7 of us. The Clients issue is that she keeps wanting more free work. We have tried everything to make her happy. She is having all her friends and family members leave one star reviews every couple of hours. I found out this is what she does to a lot of small business. Her and family go online and  review bomb the business which destroys their google ratings. All the other company responses to the reviews is about ",
        "url": "https://reddit.com/r/smallbusiness/comments/1grpkf0/unhinged_client_leaves_bad_google_reviews_under/",
        "score": 214,
        "comments": 104,
        "source": "reddit",
        "subreddit": "smallbusiness"
      },
      {
        "title": "Grubhub just sold for $650 million. Four years ago it was worth $7.3 billion. Europe’s biggest meal delivery firm, Just Eat Takeaway, said on Wednesday it had struck a deal to sell its U.S. unit Grubhub to Wonder for $650 million.",
        "content": "",
        "url": "https://reddit.com/r/business/comments/1gqif8w/grubhub_just_sold_for_650_million_four_years_ago/",
        "score": 2615,
        "comments": 89,
        "source": "reddit",
        "subreddit": "business"
      },
      {
        "title": "REI bans frequent returners as return fraud costs retailers billions annually",
        "content": "",
        "url": "https://reddit.com/r/business/comments/1gtjeiz/rei_bans_frequent_returners_as_return_fraud_costs/",
        "score": 2768,
        "comments": 94,
        "source": "reddit",
        "subreddit": "business"
      },
      {
        "title": "Rise of Middle-Class Shoplifters: Americans Are Stealing From Stores",
        "content": "",
        "url": "https://reddit.com/r/business/comments/1giyiwv/rise_of_middleclass_shoplifters_americans_are/",
        "score": 1883,
        "comments": 636,
        "source": "reddit",
        "subreddit": "business"
      },
      {
        "title": "Woman who died in bakery oven at Halifax Walmart found by her mother, organization says",
        "content": "",
        "url": "https://reddit.com/r/business/comments/1gb7gwn/woman_who_died_in_bakery_oven_at_halifax_walmart/",
        "score": 1169,
        "comments": 478,
        "source": "reddit",
        "subreddit": "business"
      },
      {
        "title": "Why Is Warren Buffett Selling So Much Stock?",
        "content": "",
        "url": "https://reddit.com/r/business/comments/1gpy97d/why_is_warren_buffett_selling_so_much_stock/",
        "score": 1128,
        "comments": 225,
        "source": "reddit",
        "subreddit": "business"
      },
      {
        "title": "Selling business. Don’t know how to compensate an employee that has been with me for 25 years. ",
        "content": "So basically, that’s my dilemma. Family business and partners don’t agree on how to say thank you to this treasured worker. We are not corporate. Just a small business and not getting a giant windfall. He has been hourly and with overtime makes about 75k a year. Thanks in advance for your insights. ",
        "url": "https://reddit.com/r/business/comments/1gcuozh/selling_business_dont_know_how_to_compensate_an/",
        "score": 852,
        "comments": 328,
        "source": "reddit",
        "subreddit": "business"
      },
      {
        "title": "Sales are sliding at KFC and Burger King as fast-food chains keep struggling",
        "content": "",
        "url": "https://reddit.com/r/business/comments/1gmrepf/sales_are_sliding_at_kfc_and_burger_king_as/",
        "score": 708,
        "comments": 136,
        "source": "reddit",
        "subreddit": "business"
      },
      {
        "title": "Bluesky ‘unaware’ of reason for 140% share price gain",
        "content": "",
        "url": "https://reddit.com/r/business/comments/1grjrhm/bluesky_unaware_of_reason_for_140_share_price_gain/",
        "score": 474,
        "comments": 37,
        "source": "reddit",
        "subreddit": "business"
      },
      {
        "title": "Walmart will likely raise some prices if Trump tariffs take effect, CFO says",
        "content": "",
        "url": "https://reddit.com/r/business/comments/1gv0xk4/walmart_will_likely_raise_some_prices_if_trump/",
        "score": 464,
        "comments": 96,
        "source": "reddit",
        "subreddit": "business"
      },
      {
        "title": "Peacock Lost $436 Million in Paris Olympics Quarter",
        "content": "",
        "url": "https://reddit.com/r/business/comments/1gil7rv/peacock_lost_436_million_in_paris_olympics_quarter/",
        "score": 291,
        "comments": 22,
        "source": "reddit",
        "subreddit": "business"
      },
      {
        "title": "For all of you sociopathic businesspeople that complain about worker safety regulations, remember that workers' safety laws are written in blood.",
        "content": "Countless workers have died in order to secure a higher profit for rich businesspeople who get to spend less on safety and extract more revenue, as replacing a dead employee or paying out civil suits is cheaper than actually instituting the necessary changes.\n\nRemember that next time you start complaining about \"big government\" and their awful, inefficient, stifling regulations.\n\nHuman life is more important than profit. Workers are not numbers on a spreadsheet, they are people with moral value,",
        "url": "https://reddit.com/r/business/comments/1gcnzj1/for_all_of_you_sociopathic_businesspeople_that/",
        "score": 237,
        "comments": 71,
        "source": "reddit",
        "subreddit": "business"
      },
      {
        "title": "T.G.I. Friday's files for bankruptcy",
        "content": "",
        "url": "https://reddit.com/r/business/comments/1ghttvh/tgi_fridays_files_for_bankruptcy/",
        "score": 234,
        "comments": 82,
        "source": "reddit",
        "subreddit": "business"
      },
      {
        "title": "Swedish firm censured for use of C-word in ads for vaginal health supplements ",
        "content": "",
        "url": "https://reddit.com/r/business/comments/1gr9d8b/swedish_firm_censured_for_use_of_cword_in_ads_for/",
        "score": 206,
        "comments": 27,
        "source": "reddit",
        "subreddit": "business"
      },
      {
        "title": "Today I failed ",
        "content": "\nHi everyone.\n\nToday I closed the door to my business into which I invested all my blood, sweat, tears and money for 5 years.\n\nThis is a terrible feeling as that business consumed a lot of my time and funds that I took away from my family. It also caused me a huge amount of stress that adversely affected my health and marriage.\n\nI know that a lot of you had been through this, and that there is no reward for not taking a risk but somehow it still sucks very badly.\n\nHow do you find solace and stre",
        "url": "https://reddit.com/r/business/comments/1gunzdg/today_i_failed/",
        "score": 187,
        "comments": 65,
        "source": "reddit",
        "subreddit": "business"
      },
      {
        "title": "Lyft fined $2.1 million for misleading ads about how much drivers could make",
        "content": "",
        "url": "https://reddit.com/r/business/comments/1gf1up8/lyft_fined_21_million_for_misleading_ads_about/",
        "score": 137,
        "comments": 4,
        "source": "reddit",
        "subreddit": "business"
      },
      {
        "title": "How I made 15K+ in a month with a simple python script and nicotine pouches",
        "content": "So, this is one of those dumb ideas that somehow worked out way better than expected. I live in a country where nicotine pouches weren’t sold… until recently. A company opened up selling them, and people were losing their minds over it. They would put new stock on their website at random times, and every day it would sell out within 3-5 minutes. If you weren’t fast, you missed out.\n\nI was actually using these pouches myself and getting tired of missing the drops. So, I wrote a simple Python scri",
        "url": "https://reddit.com/r/Entrepreneur/comments/1gjap3l/how_i_made_15k_in_a_month_with_a_simple_python/",
        "score": 3275,
        "comments": 227,
        "source": "reddit",
        "subreddit": "Entrepreneur"
      },
      {
        "title": "Is anyone automating their cold email outreach at scale? Looking for solutions that simplify email deliverability",
        "content": "I've been exploring ways to scale cold email outreach without running into the usual roadblocks like domain health and warm-ups. In my experience, setting up domains manually and dealing with constant churn has been a huge pain, especially when you're trying to scale up quickly.\n\nI'm curious if anyone here has tried out newer methods or tools that streamline the process. Specifically, I'd love to hear how you're handling:\n\n* Domain setup times\n* Email volume per day (without getting your domain ",
        "url": "https://reddit.com/r/Entrepreneur/comments/1gbh4ha/is_anyone_automating_their_cold_email_outreach_at/",
        "score": 2935,
        "comments": 103,
        "source": "reddit",
        "subreddit": "Entrepreneur"
      },
      {
        "title": "I made it: I'm a multi-millionaire and now life sucks",
        "content": "Man, mid 30's.\n\nI've been working for the last 15 years Monday to Sunday, every day at least 10 hours, Sunday maybe 4-8.\n\nThe last 2 years I've had the best results and my net worth is over 5M. I only own a stinking old car, nothing else in physical possession except a computer, clothes, watch and little else. I live between the US and Europe. You might wonder why I have so little; because people like me who have been through it are like that.\n\nI could retire and live very comfortably, which I h",
        "url": "https://reddit.com/r/Entrepreneur/comments/1gpj337/i_made_it_im_a_multimillionaire_and_now_life_sucks/",
        "score": 1848,
        "comments": 1433,
        "source": "reddit",
        "subreddit": "Entrepreneur"
      },
      {
        "title": "Finally making it ",
        "content": "I had my first $15k month. I know this is small potatoes money to some folks here, but it's so nice seeing this. \n\nI grew up so poor. Like, trying to invite myself to dinner at friends houses because there wasn't food. Seeing my breath in my house when it got cold. That kind of poor. \n\nMy dad passed away from cancer when I was 8 and my mom got injured at work a few years later. I'm the only one of my siblings who made it through college and doesn't let their mental health and circumstances contr",
        "url": "https://reddit.com/r/Entrepreneur/comments/1gu78vg/finally_making_it/",
        "score": 761,
        "comments": 114,
        "source": "reddit",
        "subreddit": "Entrepreneur"
      },
      {
        "title": "43. Built 4 mildly successful companies, exited one for 8figs. Can’t get hired by anyone. ",
        "content": "I’ve been LFG for 2 years. \n20 interviews. \n0 offers. \n\nOften I am told I am too skilled for the role. The role would bore me, etc. \n\nI’d like to just get a job and work the hours. \n\nNo one wants to hire me. \n\nIt’s miserable. I can close a sale, market and grow a product, hire the right people, raise money. \n\nSo. Be warned. It’s lame being 40s, paper rich/dollar poor, no insurance, no local colleages (remote work), no work relationships (remote), and no prospects. \n\nAlso, be careful about not br",
        "url": "https://reddit.com/r/Entrepreneur/comments/1gmxh9t/43_built_4_mildly_successful_companies_exited_one/",
        "score": 599,
        "comments": 334,
        "source": "reddit",
        "subreddit": "Entrepreneur"
      },
      {
        "title": "Ecomswap scam posts all over reddit ",
        "content": "You may have noticed a bunch of posts going viral this week on many subs r/business r/entrepreneur r/sidehustle etc \n\nJust search “ecomswap” and you’ll see what I mean.\n\nThe format goes like this every single time:\n\n“I just sold my ecommerce/startup/SaaS product for $xxxk!”\n\nThen the post has some ChatGPT generated story about how they were so successful, and ultimately; it comes down to some plug for how good ecomswap was. Often the top comment will be some brand new account asking “but how did",
        "url": "https://reddit.com/r/Entrepreneur/comments/1gr5tcl/ecomswap_scam_posts_all_over_reddit/",
        "score": 589,
        "comments": 47,
        "source": "reddit",
        "subreddit": "Entrepreneur"
      },
      {
        "title": "Steve Jobs on the most important job of a CEO.",
        "content": "**Steve Jobs on the most important job of a CEO**\n\n“The greatest people are self-managing. They don’t need to be managed. Once they know what to do, they’ll go figure out how to do it… What they need is a common vision, and that’s what leadership is. Leadership is having a vision, being able to articulate that so the people around you can understand it, and getting consensus on a common vision.”\n\n“We wanted people who were insanely great at what they did… and the neatest thing that happens when ",
        "url": "https://reddit.com/r/Entrepreneur/comments/1go5cpd/steve_jobs_on_the_most_important_job_of_a_ceo/",
        "score": 574,
        "comments": 78,
        "source": "reddit",
        "subreddit": "Entrepreneur"
      },
      {
        "title": "How to make 3-10K per month?",
        "content": "I have tried to make money online without success, I just dont know where to start. I am 31 years old and really want to improve my life but I have no money to buy all courses. I just want an opportunity but dont know where to start\n\nTo make things a bit more clear, I’m 31 based in South America but grew up in Sweden. I don’t have so much experience, I do have some sales exp and a little bit of marketing that’s it.\n\nI don’t really have any skills, just trying to find my way to make money online.",
        "url": "https://reddit.com/r/Entrepreneur/comments/1gt0kzl/how_to_make_310k_per_month/",
        "score": 526,
        "comments": 357,
        "source": "reddit",
        "subreddit": "Entrepreneur"
      },
      {
        "title": "Closed My Business and Returned to a Job. Here’s What I Learned About Letting Go",
        "content": "Storytime: If you’re in a rough patch in your career, keep going. Be patient, and maybe, pray a little.\n\nAround this time last year, my wife and I sat down to talk about our finances. She had just started a new job, and we needed to figure out health insurance. For almost two years, I’d been grinding it out at my now-closed sneaker store, barely making minimum wage and pinching every penny. It was tough.\n\nOne night, I asked her to show me her benefits package, and I suggested which insurance to ",
        "url": "https://reddit.com/r/Entrepreneur/comments/1gq0d7k/closed_my_business_and_returned_to_a_job_heres/",
        "score": 503,
        "comments": 94,
        "source": "reddit",
        "subreddit": "Entrepreneur"
      },
      {
        "title": "If you got 6 months to study something to make money, what would it be?",
        "content": "Welp like the title says. What would be the best to study to start making money if you only had around 6 months to get it done?\n\n\nI meant study for 6 months and start making money after that..",
        "url": "https://reddit.com/r/Entrepreneur/comments/1gersmm/if_you_got_6_months_to_study_something_to_make/",
        "score": 445,
        "comments": 497,
        "source": "reddit",
        "subreddit": "Entrepreneur"
      },
      {
        "title": "How did you become rich? ",
        "content": "Just out of curiosity, how did you escape poverty and become rich? \n\nThanks any advice? ",
        "url": "https://reddit.com/r/Entrepreneur/comments/1gol5da/how_did_you_become_rich/",
        "score": 427,
        "comments": 382,
        "source": "reddit",
        "subreddit": "Entrepreneur"
      },
      {
        "title": "How to acquire these 'boring businesses' from retiring boomers?",
        "content": "So. Let's say you take the advice that appears frequently in discussions around business acquisition and buy out a solid, financially sound business from a retiring boomer. The issue that always arises is, how feasible is it really, if you don't possess the specific skill at hand, and rather, have an understanding of general business management? For context, let's say you acquire a metal fabrication business, without specifically being a welder/boilermaker. If you are already a skilled welder, t",
        "url": "https://reddit.com/r/Entrepreneur/comments/1gbtpr9/how_to_acquire_these_boring_businesses_from/",
        "score": 399,
        "comments": 207,
        "source": "reddit",
        "subreddit": "Entrepreneur"
      },
      {
        "title": "I analyzed 306 short-form videos with 1M+ views — this 1 format keeps going viral",
        "content": "The beauty of it?\n\nAny content creator in any niche can make this type of reel in less than 5 minutes.\n\nPlus, you’re about to get an AI prompt to write the entire script for you in 3 seconds.\n\nThe video I based it on is super simple — the creator sharing an “insider hack” to save money on accommodation.\n\n(5 million views, 574K likes).\n\nDon’t think I can share the link here - but there are no fancy shots/editing. \n\nJust pure value spoken straight into the camera.\n\nThe overlayed screen caption is ",
        "url": "https://reddit.com/r/Entrepreneur/comments/1gr6kcd/i_analyzed_306_shortform_videos_with_1m_views/",
        "score": 371,
        "comments": 39,
        "source": "reddit",
        "subreddit": "Entrepreneur"
      },
      {
        "title": "Repeat after me: I don't need an earth-shattering, innovative idea",
        "content": "Posting it for the benefit of my fellow entrepreneurs and SaaS founders. Please repeat after me: I don't know an innovative idea to start my business / SaaS.\n\nI see many new entrepreneurs are trapped in the analysis-paralysis trying to find a new idea that no one has tried before. Here's a shocker: The world is full of smart people who have thought of the exact idea that you have in your head.\n\nFun fact: I thought about building a video-only site (^(cough:) youtube ^(cough)) back in early 2000s;",
        "url": "https://reddit.com/r/Entrepreneur/comments/1g9bx4j/repeat_after_me_i_dont_need_an_earthshattering/",
        "score": 364,
        "comments": 76,
        "source": "reddit",
        "subreddit": "Entrepreneur"
      },
      {
        "title": "What I learned building an app with no technical background",
        "content": "Over the past two years, my boss (my wife) finally gave me permission to chase my crazy ideas and build a couple apps for business ideas I had. While I’ve played around with WordPress some before, I have no real technical background when it comes to coding, developing, etc.\n\nThe harsh reality is this. **I wasted A LOT of time and A LOT of money because of things I had to learn the hard way.** I’m hoping by sharing some of those things here, it can help some of you who have dreams that require de",
        "url": "https://reddit.com/r/Entrepreneur/comments/1gh4y0k/what_i_learned_building_an_app_with_no_technical/",
        "score": 335,
        "comments": 75,
        "source": "reddit",
        "subreddit": "Entrepreneur"
      }
    ],
    "rss": [
      {
        "title": "Show HN: Llama 3.2 Interpretability with Sparse Autoencoders",
        "content": "Comments",
        "url": "https://github.com/PaulPauls/llama3_interpretability_sae",
        "date": "Thu, 21 Nov 2024 20:37:56 +0000",
        "source": "rss",
        "feedUrl": "https://news.ycombinator.com/rss"
      },
      {
        "title": "Handling cookies is a minefield",
        "content": "Comments",
        "url": "https://grayduck.mn/2024/11/21/handling-cookies-is-a-minefield/",
        "date": "Thu, 21 Nov 2024 17:28:11 +0000",
        "source": "rss",
        "feedUrl": "https://news.ycombinator.com/rss"
      },
      {
        "title": "The FORTH code for Chipwits is released in the game's 40th anniversary",
        "content": "Comments",
        "url": "https://chipwits.com/2024/11/16/chipwits-40th-birthday-original-forth-code-open-sourced/",
        "date": "Thu, 21 Nov 2024 18:44:11 +0000",
        "source": "rss",
        "feedUrl": "https://news.ycombinator.com/rss"
      },
      {
        "title": "WhisperNER: Unified Open Named Entity and Speech Recognition",
        "content": "Comments",
        "url": "https://arxiv.org/abs/2409.08107",
        "date": "Thu, 21 Nov 2024 21:41:41 +0000",
        "source": "rss",
        "feedUrl": "https://news.ycombinator.com/rss"
      },
      {
        "title": "Emacs Code Conversion Language",
        "content": "Comments",
        "url": "https://emacsninja.com/posts/code-conversion-language.html",
        "date": "Thu, 21 Nov 2024 18:41:32 +0000",
        "source": "rss",
        "feedUrl": "https://news.ycombinator.com/rss"
      },
      {
        "title": "Listen to the whispers: web timing attacks that work",
        "content": "Comments",
        "url": "https://portswigger.net/research/listen-to-the-whispers-web-timing-attacks-that-actually-work",
        "date": "Thu, 21 Nov 2024 18:08:09 +0000",
        "source": "rss",
        "feedUrl": "https://news.ycombinator.com/rss"
      },
      {
        "title": "Autopoietic Networks",
        "content": "Comments",
        "url": "https://gbragafibra.github.io/2024/10/08/autopoietic_nets.html",
        "date": "Thu, 21 Nov 2024 21:29:20 +0000",
        "source": "rss",
        "feedUrl": "https://news.ycombinator.com/rss"
      },
      {
        "title": "Glass Health (YC W23) is hiring founding, senior and lead full-stack engineers",
        "content": "Comments",
        "url": "https://jobs.lever.co/glass-health-inc?team=Product%20%26%20Engineering",
        "date": "Thu, 21 Nov 2024 21:44:29 +0000",
        "source": "rss",
        "feedUrl": "https://news.ycombinator.com/rss"
      },
      {
        "title": "PHP 8.4",
        "content": "Comments",
        "url": "https://www.php.net/releases/8.4/en.php",
        "date": "Thu, 21 Nov 2024 09:56:52 +0000",
        "source": "rss",
        "feedUrl": "https://news.ycombinator.com/rss"
      },
      {
        "title": "The meme-ification of the \"Demon Core\"",
        "content": "Comments",
        "url": "https://doomsdaymachines.net/p/the-meme-ification-of-the-demon-core",
        "date": "Thu, 21 Nov 2024 03:05:56 +0000",
        "source": "rss",
        "feedUrl": "https://news.ycombinator.com/rss"
      },
      {
        "title": "Apple is reportedly building a more conversational Siri powered by LLMs",
        "content": "Apple is developing a new version of its voice assistant, Siri, powered by advanced large language models (LLMs), according to sources cited by Bloomberg. This more conversational Siri is part of Apple’s attempt to catch up in AI, where competitors have released impressive features, like Google’s Ge",
        "url": "https://techcrunch.com/2024/11/21/apple-is-reportedly-building-a-more-conversational-siri-powered-by-llms/",
        "date": "Thu, 21 Nov 2024 22:20:49 +0000",
        "source": "rss",
        "feedUrl": "https://techcrunch.com/feed"
      },
      {
        "title": "Future Google supplier Kairos gets approval to build two small nuclear reactors",
        "content": "The reactors are scaled down versions of what Kairos hopes to ultimately build to supply Google with electricity.\n© 2024 TechCrunch. All rights reserved. For personal use only.",
        "url": "https://techcrunch.com/2024/11/21/future-google-supplier-kairos-gets-approval-to-build-two-small-nuclear-reactors/",
        "date": "Thu, 21 Nov 2024 22:13:41 +0000",
        "source": "rss",
        "feedUrl": "https://techcrunch.com/feed"
      },
      {
        "title": "Zepto raises another $350M amid retail upheaval in India",
        "content": "Zepto has secured $350 million in new funding, its third round of financing in six months, as the Indian quick-commerce startup strengthens its position against its competitors ahead of a planned IPO next year. Indian family offices, wealthy individuals, and asset manager Motilal Oswal invested in t",
        "url": "https://techcrunch.com/2024/11/21/zepto-raises-another-350-million-amid-retail-upheaval-in-india/",
        "date": "Thu, 21 Nov 2024 21:07:20 +0000",
        "source": "rss",
        "feedUrl": "https://techcrunch.com/feed"
      },
      {
        "title": "YouTube Shorts’ Dream Screen feature can now generate AI video backgrounds",
        "content": "YouTube announced on Thursday that its Dream Screen feature for Shorts now lets you create AI-generated video backgrounds. Up until now, Dream Screen could only create image backgrounds. The new capability is possible due to the integration of Google DeepMind’s AI video-generation model, Veo, which ",
        "url": "https://techcrunch.com/2024/11/21/youtube-shorts-dream-screen-feature-can-now-generate-ai-video-backgrounds/",
        "date": "Thu, 21 Nov 2024 20:59:54 +0000",
        "source": "rss",
        "feedUrl": "https://techcrunch.com/feed"
      },
      {
        "title": "Marissa Mayer just laid out a possible business model for ad-supported AI chatbots",
        "content": "Marissa Mayer has a lot of insights into the promise and problems with online advertising. She played an instrumental role in the early days of Google Search and spent several years as Yahoo’s CEO. Today, Mayer is the CEO of her own company, Sunshine, which is creating apps to do things like share p",
        "url": "https://techcrunch.com/2024/11/21/marissa-mayer-just-laid-out-a-possible-business-model-for-ad-supported-ai-chatbots/",
        "date": "Thu, 21 Nov 2024 20:29:58 +0000",
        "source": "rss",
        "feedUrl": "https://techcrunch.com/feed"
      },
      {
        "title": "Battery unicorn Northvolt files for bankruptcy, upending Europe’s industrial plan",
        "content": "The company chose Chapter 11 in an effort to right its listing finances. \n© 2024 TechCrunch. All rights reserved. For personal use only.",
        "url": "https://techcrunch.com/2024/11/21/battery-unicorn-northvolt-files-for-bankruptcy-upending-europes-industrial-plan/",
        "date": "Thu, 21 Nov 2024 19:03:06 +0000",
        "source": "rss",
        "feedUrl": "https://techcrunch.com/feed"
      },
      {
        "title": "Brave Search adds AI chat for follow-up questions after your initial query",
        "content": "Brave announced on Thursday that it’s introducing an AI chat mode for follow-up questions based on initial queries on Brave Search. Earlier this year, the company launched “Answer with AI” summaries that appear above search results after you submit a query to give you an easy-to-read answer in respo",
        "url": "https://techcrunch.com/2024/11/21/brave-search-adds-ai-chat-for-follow-up-questions-after-your-initial-query/",
        "date": "Thu, 21 Nov 2024 18:33:19 +0000",
        "source": "rss",
        "feedUrl": "https://techcrunch.com/feed"
      },
      {
        "title": "SpaceX signs second commercial deal for Starship lunar lander with Lunar Outpost",
        "content": "As SpaceX’s Starship test program continues to gain momentum, the company signed its second commercial deal to deliver a payload to the moon using a lunar lander variant of the massive vehicle.  Starship will deposit Lunar Outpost’s rugged rover, called Eagle, to the lunar surface by 2029, the Color",
        "url": "https://techcrunch.com/2024/11/21/spacex-signs-second-commercial-deal-for-starship-lunar-lander-with-lunar-outpost/",
        "date": "Thu, 21 Nov 2024 18:08:35 +0000",
        "source": "rss",
        "feedUrl": "https://techcrunch.com/feed"
      },
      {
        "title": "Cruise fesses up, Pony AI raises its IPO ambitions, and the TuSimple drama dials back up",
        "content": "Welcome back to TechCrunch Mobility — your central hub for news and insights on the future of transportation. Sign up here for free — just click TechCrunch Mobility! President-elect Trump has wasted little time picking cabinet members, including naming former Wisconsin Rep. Sean Duffy as the next se",
        "url": "https://techcrunch.com/2024/11/21/cruise-fesses-up-pony-ai-raises-its-ipo-ambitions-and-the-tusimple-drama-dials-back-up/",
        "date": "Thu, 21 Nov 2024 18:07:00 +0000",
        "source": "rss",
        "feedUrl": "https://techcrunch.com/feed"
      },
      {
        "title": "German fintech unicorn N26 just had its first profitable quarter",
        "content": "Ten years after pitching onstage at TechCrunch Disrupt in London, fintech N26 has reported its first ever quarterly (pretax) profit. The challenger bank with millions of customers across Europe generated a net operating income of €2.8 million during the third quarter of 2024 (or $2.9 million at curr",
        "url": "https://techcrunch.com/2024/11/21/german-fintech-unicorn-n26-just-had-its-first-profitable-quarter/",
        "date": "Thu, 21 Nov 2024 17:48:20 +0000",
        "source": "rss",
        "feedUrl": "https://techcrunch.com/feed"
      },
      {
        "title": "Star Wars Outlaws rolls out more changes and fixes in bid for more buys",
        "content": "Ubisoft rolls out the long-awaited major update for Star Wars Outlaws -- fixes that'll help revitalize the game in time for holiday sales.",
        "url": "https://venturebeat.com/games/star-wars-outlaws-rolls-out-more-changes-and-fixes-in-bid-for-more-buys/",
        "date": "Thu, 21 Nov 2024 19:32:29 +0000",
        "source": "rss",
        "feedUrl": "https://feeds.feedburner.com/venturebeat/SZYF"
      },
      {
        "title": "H2O.ai improves AI agent accuracy with predictive models",
        "content": "AI agents need to consistent, and H2O.ai believes a mix of generative and predictive AI models is the answer.",
        "url": "https://venturebeat.com/ai/h20-ai-improves-ai-agent-accuracy-with-predictive-models/",
        "date": "Thu, 21 Nov 2024 19:30:00 +0000",
        "source": "rss",
        "feedUrl": "https://feeds.feedburner.com/venturebeat/SZYF"
      },
      {
        "title": "Google Cloud launches AI Agent Space amid rising competition",
        "content": "VentureBeat's viewing of the AI Agent Space revealed only 19 distinct agent models available for use, a fry cry from cloud rivals.",
        "url": "https://venturebeat.com/ai/google-cloud-launches-ai-agent-space-amid-rising-competition/",
        "date": "Thu, 21 Nov 2024 19:29:55 +0000",
        "source": "rss",
        "feedUrl": "https://feeds.feedburner.com/venturebeat/SZYF"
      },
      {
        "title": "Will Sam Altman always win the OpenAI board fight in an AI agent simulation?",
        "content": "Fable built its AI Sim Francisco \"war game\" to find out why OpenAI's behind closed doors board fight turned out the way it did.",
        "url": "https://venturebeat.com/games/can-sam-altman-win-the-openai-board-fight-in-an-ai-agent-simulation/",
        "date": "Thu, 21 Nov 2024 18:00:00 +0000",
        "source": "rss",
        "feedUrl": "https://feeds.feedburner.com/venturebeat/SZYF"
      },
      {
        "title": "Ubitium tackles edge AI and more with new universal processor",
        "content": "With this chip, Ubitium hopes it will be able to replace dedicated processors for specialized computing tasks at the edge, like NPUs for AI.",
        "url": "https://venturebeat.com/data-infrastructure/ubitium-tackles-edge-ai-and-more-with-new-universal-processor/",
        "date": "Thu, 21 Nov 2024 16:51:40 +0000",
        "source": "rss",
        "feedUrl": "https://feeds.feedburner.com/venturebeat/SZYF"
      },
      {
        "title": "Will Republicans continue to support subsidies for the chip industry? | PwC interview",
        "content": "The Chips & Science Act was a bipartisan law passed to give $52 billion to the U.S. semiconductor industry. Will Republicans stand behind it?",
        "url": "https://venturebeat.com/ai/will-republicans-continue-to-support-subsidies-for-the-chip-industry-pwc-interview/",
        "date": "Thu, 21 Nov 2024 14:30:00 +0000",
        "source": "rss",
        "feedUrl": "https://feeds.feedburner.com/venturebeat/SZYF"
      },
      {
        "title": "Anomalo’s unstructured data solution cuts enterprise AI deployment time by 30%",
        "content": "Data quality vendor raises new money as it expands its unstructured data quality monitoring technology in a bid to help accelerate enterprise AI deployment.",
        "url": "https://venturebeat.com/data-infrastructure/anomalo-aims-to-accelerate-deployment-of-enterprise-ai-by-30-with-unstructured-data-quality-monitoring/",
        "date": "Thu, 21 Nov 2024 14:00:00 +0000",
        "source": "rss",
        "feedUrl": "https://feeds.feedburner.com/venturebeat/SZYF"
      },
      {
        "title": "Wordware raises $30 million to make AI development as easy as writing a document",
        "content": "Wordware, a San Francisco startup, raised $30 million to simplify AI development with a natural language platform, enabling non-coders to build AI agents without traditional programming.",
        "url": "https://venturebeat.com/ai/how-wordware-30m-seed-round-could-disrupt-the-entire-ai-development-industry/",
        "date": "Thu, 21 Nov 2024 14:00:00 +0000",
        "source": "rss",
        "feedUrl": "https://feeds.feedburner.com/venturebeat/SZYF"
      },
      {
        "title": "xpander.ai’s Agent Graph System makes AI agents more reliable, gives them info step-by-step",
        "content": "It enables AI agents to achieve a 98% success rate in multi-step tasks, compared to just 24% for agents using traditional methods.",
        "url": "https://venturebeat.com/ai/xpander-ais-agent-graph-system-makes-ai-agents-more-reliable-by-giving-them-info-step-by-step/",
        "date": "Thu, 21 Nov 2024 13:30:00 +0000",
        "source": "rss",
        "feedUrl": "https://feeds.feedburner.com/venturebeat/SZYF"
      },
      {
        "title": "OpenScholar: The open-source A.I. that’s outperforming GPT-4o in scientific research",
        "content": "OpenScholar, an innovative AI system by Allen Institute for AI and University of Washington, revolutionizes scientific research by processing 45 million papers instantly, offering researchers citation-backed answers and challenging proprietary AI systems.",
        "url": "https://venturebeat.com/ai/openscholar-the-open-source-a-i-thats-outperforming-gpt-4o-in-scientific-research/",
        "date": "Thu, 21 Nov 2024 01:17:38 +0000",
        "source": "rss",
        "feedUrl": "https://feeds.feedburner.com/venturebeat/SZYF"
      },
      {
        "title": "Boba",
        "content": "",
        "url": "https://trends.google.com/trends/trendingsearches/daily?geo=US#Boba",
        "date": "Thu, 21 Nov 2024 02:00:00 -0800",
        "source": "rss",
        "feedUrl": "https://trends.google.com/trends/trendingsearches/daily/rss"
      },
      {
        "title": "ICC",
        "content": "Benjamin Netanyahu",
        "url": "https://trends.google.com/trends/trendingsearches/daily?geo=US#ICC",
        "date": "Thu, 21 Nov 2024 08:00:00 -0800",
        "source": "rss",
        "feedUrl": "https://trends.google.com/trends/trendingsearches/daily/rss"
      },
      {
        "title": "Browns",
        "content": "Cleveland Browns",
        "url": "https://trends.google.com/trends/trendingsearches/daily?geo=US#Browns",
        "date": "Thu, 21 Nov 2024 13:00:00 -0800",
        "source": "rss",
        "feedUrl": "https://trends.google.com/trends/trendingsearches/daily/rss"
      },
      {
        "title": "Jelly Roll",
        "content": "",
        "url": "https://trends.google.com/trends/trendingsearches/daily?geo=US#Jelly%20Roll",
        "date": "Thu, 21 Nov 2024 10:00:00 -0800",
        "source": "rss",
        "feedUrl": "https://trends.google.com/trends/trendingsearches/daily/rss"
      },
      {
        "title": "Gaetz withdraws",
        "content": "Matt Gaetz withdraws",
        "url": "https://trends.google.com/trends/trendingsearches/daily?geo=US#Gaetz%20withdraws",
        "date": "Thu, 21 Nov 2024 13:00:00 -0800",
        "source": "rss",
        "feedUrl": "https://trends.google.com/trends/trendingsearches/daily/rss"
      },
      {
        "title": "Jussie Smollett",
        "content": "",
        "url": "https://trends.google.com/trends/trendingsearches/daily?geo=US#Jussie%20Smollett",
        "date": "Thu, 21 Nov 2024 10:00:00 -0800",
        "source": "rss",
        "feedUrl": "https://trends.google.com/trends/trendingsearches/daily/rss"
      },
      {
        "title": "ICBM",
        "content": "",
        "url": "https://trends.google.com/trends/trendingsearches/daily?geo=US#ICBM",
        "date": "Thu, 21 Nov 2024 08:00:00 -0800",
        "source": "rss",
        "feedUrl": "https://trends.google.com/trends/trendingsearches/daily/rss"
      },
      {
        "title": "Julian Lewis",
        "content": "",
        "url": "https://trends.google.com/trends/trendingsearches/daily?geo=US#Julian%20Lewis",
        "date": "Thu, 21 Nov 2024 11:00:00 -0800",
        "source": "rss",
        "feedUrl": "https://trends.google.com/trends/trendingsearches/daily/rss"
      },
      {
        "title": "Coral",
        "content": "",
        "url": "https://trends.google.com/trends/trendingsearches/daily?geo=US#Coral",
        "date": "Thu, 21 Nov 2024 09:00:00 -0800",
        "source": "rss",
        "feedUrl": "https://trends.google.com/trends/trendingsearches/daily/rss"
      },
      {
        "title": "Ground beef recalled",
        "content": "",
        "url": "https://trends.google.com/trends/trendingsearches/daily?geo=US#Ground%20beef%20recalled",
        "date": "Thu, 21 Nov 2024 14:00:00 -0800",
        "source": "rss",
        "feedUrl": "https://trends.google.com/trends/trendingsearches/daily/rss"
      },
      {
        "title": "HumanLayer",
        "content": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/humanlayer",
        "date": "2024-11-20T06:57:33.000Z",
        "source": "rss",
        "feedUrl": "https://www.producthunt.com/feed"
      },
      {
        "title": "The Threadinator™ for 𝕏",
        "content": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/the-threadinator-for",
        "date": "2024-11-20T23:12:17.000Z",
        "source": "rss",
        "feedUrl": "https://www.producthunt.com/feed"
      },
      {
        "title": "Desktop Recording SDK by Recall.ai",
        "content": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/desktop-recording-sdk-by-recall-ai",
        "date": "2024-11-18T17:47:09.000Z",
        "source": "rss",
        "feedUrl": "https://www.producthunt.com/feed"
      },
      {
        "title": "Face Recognition Attendance system",
        "content": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/face-recognition-attendance-system",
        "date": "2024-11-21T06:14:53.000Z",
        "source": "rss",
        "feedUrl": "https://www.producthunt.com/feed"
      },
      {
        "title": "Second Sense",
        "content": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/second-sense",
        "date": "2024-11-20T22:26:51.000Z",
        "source": "rss",
        "feedUrl": "https://www.producthunt.com/feed"
      },
      {
        "title": "Lovable",
        "content": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/lovable",
        "date": "2024-11-13T12:37:50.000Z",
        "source": "rss",
        "feedUrl": "https://www.producthunt.com/feed"
      },
      {
        "title": "Taskia",
        "content": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/taskia",
        "date": "2024-07-11T21:36:24.000Z",
        "source": "rss",
        "feedUrl": "https://www.producthunt.com/feed"
      },
      {
        "title": "Fireside",
        "content": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/fireside-9",
        "date": "2024-11-19T14:27:43.000Z",
        "source": "rss",
        "feedUrl": "https://www.producthunt.com/feed"
      },
      {
        "title": "notclass",
        "content": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/notclass-2",
        "date": "2024-11-13T08:55:52.000Z",
        "source": "rss",
        "feedUrl": "https://www.producthunt.com/feed"
      },
      {
        "title": "Taurin",
        "content": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/taurin",
        "date": "2024-11-20T11:51:06.000Z",
        "source": "rss",
        "feedUrl": "https://www.producthunt.com/feed"
      }
    ],
    "producthunt": [
      {
        "title": "HumanLayer",
        "description": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/humanlayer",
        "date": "2024-11-20T06:57:33.000Z",
        "source": "producthunt"
      },
      {
        "title": "The Threadinator™ for 𝕏",
        "description": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/the-threadinator-for",
        "date": "2024-11-20T23:12:17.000Z",
        "source": "producthunt"
      },
      {
        "title": "Desktop Recording SDK by Recall.ai",
        "description": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/desktop-recording-sdk-by-recall-ai",
        "date": "2024-11-18T17:47:09.000Z",
        "source": "producthunt"
      },
      {
        "title": "Face Recognition Attendance system",
        "description": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/face-recognition-attendance-system",
        "date": "2024-11-21T06:14:53.000Z",
        "source": "producthunt"
      },
      {
        "title": "Second Sense",
        "description": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/second-sense",
        "date": "2024-11-20T22:26:51.000Z",
        "source": "producthunt"
      },
      {
        "title": "Lovable",
        "description": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/lovable",
        "date": "2024-11-13T12:37:50.000Z",
        "source": "producthunt"
      },
      {
        "title": "Taskia",
        "description": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/taskia",
        "date": "2024-07-11T21:36:24.000Z",
        "source": "producthunt"
      },
      {
        "title": "Fireside",
        "description": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/fireside-9",
        "date": "2024-11-19T14:27:43.000Z",
        "source": "producthunt"
      },
      {
        "title": "notclass",
        "description": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/notclass-2",
        "date": "2024-11-13T08:55:52.000Z",
        "source": "producthunt"
      },
      {
        "title": "Taurin",
        "description": "Discussion\n            |\n            Link",
        "url": "https://www.producthunt.com/posts/taurin",
        "date": "2024-11-20T11:51:06.000Z",
        "source": "producthunt"
      }
    ]
  }
}